from django.http import HttpResponse
from django.shortcuts import render

def show_image(request):
    image_path = 'photo/img.png'  # Путь к вашему изображению в директории static
    return render(request, 'image_page.html', {'image_path': image_path})
def news(request):
    return HttpResponse(
            '<img src="{% static image_path %}" alt="Изображение"><h1 style="color: red">Yangiliklar</h1><a href ="/news/simple/" > Тошкент шаҳри ҳавосини нималар ифлослаяпти ва уни қандай яхшилаш мумкин?  </a><br><a href="/news/simple/a">UzAuto Motors шартномани қачон очади?</a>'
                                  )
def news_simple(request):
    return HttpResponse(
          '<h1 style="color: black">Тошкент шаҳри ҳавосини нималар ифлослаяпти ва уни қандай яхшилаш мумкин?</h1>'
          '<h2 style="color: black>"Қурилишдаги хаос, машинадан чиқаётган заҳарлар, ривожланмаган жамоат транспорти, инфратузилма йўқлиги, саноат чиқиндилари, кўмир ва мазутдан фойдаланишнинг ортгани Тошкент шаҳри ҳавосини ифлослантирувчи асосий омиллар сифатида кўрсатилган.  Бундан ташқари, Тошкент шаҳри атмосфера ҳавосида кислород улушининг ҳам нисбатан камайиб бораётгани аниқланган.</h2>'
          '<img src="{% img.png%}" alt="Изображение">'
          '<h3 style="color: black>"Экспертлар маълумотига кўра, Тошкент шаҳридаги ҳаво ифлосланишини автоматик назорат қилувчи станциялар томонидан углерод оксиди (CO) миқдори"</h3>'
          '<a href="/news/">Orqaga</a>'

                        )
def news_simple_a(request):
    return HttpResponse(
          '<h1 style="color: black">UzAuto Motors шартномани қачон очади?</h1>'
          '<h2 style="color: black>"Қурилишдаги хаос, машинадан чиқаётган заҳарлар, ривожланмаган жамоат транспорти, инфратузилма йўқлиги, саноат чиқиндилари, кўмир ва мазутдан фойдаланишнинг ортгани Тошкент шаҳри ҳавосини ифлослантирувчи асосий омиллар сифатида кўрсатилган.  Бундан ташқари, Тошкент шаҳри атмосфера ҳавосида кислород улушининг ҳам нисбатан камайиб бораётгани аниқланган.</h2>'
          '<img src="{% static image_path %}" alt="Изображение">'
          '<h3 style="color: black>"Экспертлар маълумотига кўра, Тошкент шаҳридаги ҳаво ифлосланишини автоматик назорат қилувчи станциялар томонидан углерод оксиди (CO) миқдори"</h3>'
          '<a href="/news/">Orqaga</a>'

                        )
